{"basics":{"name":"Jakub Wasylkowski","label":"Software Developer","image":"","email":"jjwasyl.lone@gmail.com","phone":"(630) 532 8793","url":"https://jjwasyl.github.io/","summary":"A multidisciplinary Engineer with a strong background in software development, game development, artificial intelligence, devops and European Law","location":{"address":"1221 Taylor Ave N, Apt 503","postalCode":"WA 98109","city":"Seattle","countryCode":"US","region":"Washington"},"profiles":[{"network":"LinkedIn","username":"jwasylkowski","url":"https://www.linkedin.com/in/jwasylkowski/"}]},"work":[{"name":"Oracle Cloud Infrastructure","position":"Senior Software Developer","url":"https://www.oracle.com/cloud/","startDate":"2021-02","endDate":"Present","summary":"Worked on OCI's Operating Systems and Cloud Agent teams delivering state of the art cloud solutions to customers worldwide","highlights":["Designed and implemented build and publishing automation for OS images to the Oracle Cloud platform resulting in a 75% delivery time reduction to customers.","Automated management of a fleet of 200 licensing servers reducing required maintenance from biweekly to quarterly.","Engineered and deployed stable code for Cavium applications, accommodating over 2 million customer requests daily and enhancing system reliability by 30%.","Engineered automation scripts to overcome version control bottlenecks in data center bootstrapping; enhanced efficiency, cut manual labor by saving the team 25 hours per month.","Developed and deployed an OS monitoring agent used by 90% of virtual machines on OCI; led feature integrations, coordinated patching with multiple teams, and automated patch cycles.","Elevated to senior position within two years. Orchestrated design and implementation of key features and mentored new hires, helping improve technical acumen and integration. ","Specialized in backend development and DevOps, with expertise in designing and implementing scalable, high-performance server-side applications and automated deployment pipelines.","Managed three high-profile compliance review projects, engaging OCI’s institutional clients and the US government, resulting in a 100% decrease in compliance violations. ","Performed over 20 weeks of on-call rotations: managed high-pressure outages, demonstrated good crisis management in unexpected scenarios to ensure continuous service availability and reliability."]},{"name":"Lekta AI","position":"Junior Language Engineer","url":"https://lekta.ai/","startDate":"2018-10","endDate":"2019-05","summary":"Worked for a startup pioneering the agentic AI ecosystem for customer support applications.","highlights":["Devised and implemented a voice chat-bot for European telecom customers, facilitating 500,000 calls per month and lowering the need for consultants while sustaining high resolution rates.","Re-designed the app conversational logic during a core framework migration, resulting in a 40% improvement in “Time to resolution”.","Improved network efficiency and overhauled API design reducing latency and boosting positive user feedback."]},{"name":"Accenture","position":"Infrastructure Technician","url":"https://www.accenture.com/","startDate":"2016-09","endDate":"2017-06","summary":"Worked for a large outsourcing outfit in Warsaw, handling a wide array of second line support tasks.","highlights":["Managed the infrastructure of 2,000+ physical devices, ensuring 100% uptime and high availability through maintenance and incident response.","Charged with second tier customer support, delivering timely and professional assistance."]}],"education":[{"institution":"Northwestern University, Evanston, IL, United States","location":"Evanston, IL, United States","url":"https://www.northwestern.edu/","area":"Computer Science","studyType":"Master's","startDate":"2019","endDate":"2021","courses":["Artificial Intelligence, Cryptography, Game Development, Low level Programming"]},{"institution":"Jagiellonian University, Kraków, Poland","location":"Kraków, Poland","url":"https://en.uj.edu.pl/en","area":"Computer Science","studyType":"Bachelor's","startDate":"2015","endDate":"2019","courses":["Artificial Intelligence, Game Development, Low level Programming, Numerical Methods, Legal Tech"]},{"institution":"University of Luxembourg, Luxembourg","location":"Luxembourg","url":"https://www.uni.lu/en/","area":"Law","studyType":"Bachelor's","startDate":"2012","endDate":"2015","courses":["European Law","Common Law","Cryptocurrency regulation","Legal Tech"]}],"languages":[{"language":"Polish","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Native speaker","icon":""},{"language":"French","fluency":"Fluent","icon":""},{"language":"German","fluency":"Perpetual beginner","icon":""}],"interests":[{"name":"Software Development","icon":"fa-solid fa-hashtag","keywords":["Python","DevOps","Terraform","Bash","PowerShell","Docker","Git","Grafana"]},{"name":"Game Development","icon":"fa-solid fa-hashtag","keywords":["C#","Unity","GML"]}]}